[
  {
    "index_by_10": 1,
    "sentiment": "anticipation",
    "n": 6,
    "line_number": 5,
    "emotion_word_count": 2,
    "full_text": "Mr Ogden and myself drew up a notice at Mr Bonsals' Book Store, at No 33 1/2 Market Street, Philadelphia and inserted the same in the \"Ledger,\" and \"North American.\" The advertisment requesting all desirous of making a speedy and an agreeable journey via Matamoras, Monterey, Saltileo, Durango and Mazatlan to California to address \"Camargo,\" at the office's of those two respective papers, which was soon followed by a number of applicants; who were severally visited by Mr Ogden and myself."
  },
  {
    "index_by_10": 2,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 10,
    "emotion_word_count": 2,
    "full_text": "Having ascertained that the abovenamed route was infested with hoards of warlike and savage Camanchee Indians, who were committing outrages and massacring those found in their way, and that the same route was in consequence very dangerous, and believing it rash, as also influenced by friends, I withdrew my name from that route, and proposed the Tampico route to the company as the safest, most pleasant, and a shorter land distance than the former; which then being unfavorably received, I withdrew by advice, and my own impressions of that course, and then prepared to proceed around by Cape Horn."
  },
  {
    "index_by_10": 3,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 20,
    "emotion_word_count": 3,
    "full_text": "The citizens upon the wharves responded - \"three cheers for the success of the Carmago Company\" followed by a succession of cheers for individuals named in our company, among which the clerk of the Ship \"Mason,\" observing my singular dress in common with my comrades and knowing me, gave \"three cheers for the Buckskin Injnn.\" and thus did our friends cheer us at the hour of separating from all that was dear to us, to embark upon the great and eventful Ocean of future prospects."
  },
  {
    "index_by_10": 4,
    "sentiment": "joy",
    "n": 9,
    "line_number": 36,
    "emotion_word_count": 3,
    "full_text": "This evening being much moderated, with a clear and beautiful Moon, most of our party promenade the whole round of the vessel in rapid Military order, whilst the brig bounded upon the long and high Ocean Swells with that majesty becomming the bread bosom of the Atlantic; whilst the spray threw up to the bowsprit and the sheeted sides, it's showery foam, gilded by the silvery rags of the Moon, and followed in the wake  by a long bright trail of foaming ripples receding in our pathway back to the horizon.Our boat dashed on handsomely to the tune of a brisk wind, whilst the music and merry songs of the happier ones arose in concert with the gently whistling winds that playfully tuned their ocean song amid our rigging and canvass."
  },
  {
    "index_by_10": 5,
    "sentiment": "anger",
    "n": 10,
    "line_number": 49,
    "emotion_word_count": 4,
    "full_text": "Upon the whole it was a day of miserable sickening, storm, gales and long billows many of which were full 25 feet in perpendicular height. Clouds, rain, howling winds and high sea raged all day."
  },
  {
    "index_by_10": 6,
    "sentiment": "anger",
    "n": 3,
    "line_number": 51,
    "emotion_word_count": 1,
    "full_text": "Our stove being upset this morning we did not rectify it, nor feel the need of it."
  },
  {
    "index_by_10": 7,
    "sentiment": "anticipation",
    "n": 5,
    "line_number": 60,
    "emotion_word_count": 2,
    "full_text": "At 12, at noon, we passed a sail in the distance and at 1.0.clock P.M. another to which we hoisted a red flag with red star upon a square white ground, which they answered with the American flag; the winds and the ocean being  to high to speak them."
  },
  {
    "index_by_10": 8,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 71,
    "emotion_word_count": 2,
    "full_text": "At 4 O.clock P.M. we held a meeting on the Quarterdeck during which time we elected Mr. Grant, our Captain, for the trip over Mexico to Mazatlan."
  },
  {
    "index_by_10": 9,
    "sentiment": "anticipation",
    "n": 5,
    "line_number": 80,
    "emotion_word_count": 1,
    "full_text": "No wind and almost quiet; Ocean almost quiet; This day proved to be a regular calm, and the sun very warm."
  },
  {
    "index_by_10": 10,
    "sentiment": "anger",
    "n": 6,
    "line_number": 93,
    "emotion_word_count": 3,
    "full_text": "At night a black and angry storm rolled over us with rain and fierce winds raising huge billows, howling and tossing us fearfully about on the ocean all night."
  },
  {
    "index_by_10": 11,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 104,
    "emotion_word_count": 4,
    "full_text": "There is something exquisite, glowing, brilliant and more diversified with brilliant and unapproachable colors accompanying a sun set scene in this southern chime, that seldom occurs to those farther north, and infinitely above the Artists pencil. [*Wednesday 14th *] Temperature mild, high and favorable wind driving us rapidly to the South west over the gulf of Mexico."
  },
  {
    "index_by_10": 12,
    "sentiment": "fear",
    "n": 5,
    "line_number": 110,
    "emotion_word_count": 2,
    "full_text": "One of our company Mr Chevallier, fell  down our cabin stairs this morning, but was not seriously injured, though stunned by the (long) fall."
  },
  {
    "index_by_10": 13,
    "sentiment": "anticipation",
    "n": 3,
    "line_number": 120,
    "emotion_word_count": 1,
    "full_text": "The sick ones of yesterday are getting lively again. no land yet in sight. pleasant evening and travelling rapidly ahead."
  },
  {
    "index_by_10": 14,
    "sentiment": "joy",
    "n": 3,
    "line_number": 130,
    "emotion_word_count": 1,
    "full_text": "Many porposes were playing  in the gulf as we entered the river. it was a beautiful sun set scene, and the weather quite warm.  we were not permitted to go on shore this evening."
  },
  {
    "index_by_10": 15,
    "sentiment": "anger",
    "n": 3,
    "line_number": 142,
    "emotion_word_count": 1,
    "full_text": "The mainplaza, is paved with limestone (vide sketch No 2.) in the centre of which there is a large circular pediment of limestone rising in 6 steps, upon the summet of which there was once a monument of Santa Anna; which has been destroyed in their Revolutionary events."
  },
  {
    "index_by_10": 16,
    "sentiment": "anger",
    "n": 2,
    "line_number": 154,
    "emotion_word_count": 1,
    "full_text": "We saw several military parades, as large forces were temporarily stationed here,  to prevent a rise on the part of the citizens of this city and State for independence, and annexation to Texas, or  in plain words Annexation to the United States."
  },
  {
    "index_by_10": 17,
    "sentiment": "joy",
    "n": 5,
    "line_number": 162,
    "emotion_word_count": 2,
    "full_text": "You can get a good cup of coffee on the  plaza, or at the \"Caffe de Reverdy\" for a maydue or 6 1/4 cts. toast bread 6 1/4 cts. a cup of excellent chocolate one Real. 12 1/2 cts. eggs 12 1/2 cts per doz. about 2 1/2 lbs of coarse sugar for a  Quartee or 3 cent piece of silver."
  },
  {
    "index_by_10": 18,
    "sentiment": "anticipation",
    "n": 6,
    "line_number": 179,
    "emotion_word_count": 3,
    "full_text": "Mr Grant, then withdrew with a large portion of our company, leaving us but 19, which embodied a separate  mining company, having with them a large amount of mining tools, provisions, medicines, etc. amounting to considerable baggage which the other division thought would detain them some weeks longer in getting through to Mazatlan; consequently that party of 16 organized and proceeded some 5 days in advance of us, and procuring their horses at Mr. Laflers Rancho, or farm, they proceeded with dispatch to San Louis Potosi etc."
  },
  {
    "index_by_10": 19,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 188,
    "emotion_word_count": 2,
    "full_text": "To pick off 3 or 500 ticks from your pants and coat, as the cost of a venture in some places among the small weeds and bushes, might seem unreasonable, but such is very possible to occurSund 25th  The Priest, has extended an invitation to our company to  attend church."
  },
  {
    "index_by_10": 20,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 197,
    "emotion_word_count": 2,
    "full_text": "In the foreground there is a long tract of prarie, covered with the wild prarie grass, some chaparell bushes, with occasional  patches of low timber, and skirted on the margin of both waters with brushy trees, and one Rancho or (small) farm. [*Mond March 5th*] Weather warm, and yet no rain, but a pleasant  breeze each afternoon."
  },
  {
    "index_by_10": 21,
    "sentiment": "anger",
    "n": 6,
    "line_number": 203,
    "emotion_word_count": 1,
    "full_text": "He has an immense tract, stock, grain, servants &c.and raises Sugar Cane, Coffee, bannanas, Corn, and  many other things, and is the only person I see about  this section of the country making brick."
  },
  {
    "index_by_10": 22,
    "sentiment": "anticipation",
    "n": 4,
    "line_number": 210,
    "emotion_word_count": 1,
    "full_text": "This morning opened with the buz of preparation for marching to Mazatlan; but for many unprepared considerations, it was postponed one day."
  },
  {
    "index_by_10": 23,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 220,
    "emotion_word_count": 4,
    "full_text": "The road being very dusty, the sun excessively hot, water scarce and bad,  and but little available shade; we were of course quite glad to close this days journey, in camp at a small bamboo hut, on the bank of the Rio Paneuco. - and an  interesting group of dusty travellers we were too, with  a regular saw mill appetite."
  },
  {
    "index_by_10": 24,
    "sentiment": "joy",
    "n": 5,
    "line_number": 237,
    "emotion_word_count": 3,
    "full_text": "View us winding our way in single file, with baggage mules in advance, with coats off, and red flannen, as  conspicuous; with arms glistening in the mid days sun, the arrearo's or mule drivers singing out with their incessant \"mulah\", the guide ahead  smoking his cigaretto, or little paper cigar, and the  rest of the travellers following like a flock of spring birds in complete tune, and merry felicity, among dust, sunshine, and the shadeless forrests of palm. [*20*] In places however the palms, and palmettos arched over our road.and gave us a partial shade for a short period, then we would come up on an open plain, followed by a regular forrest of various trees, massive, dense, and overgrown with immense vines, and peculiar trees for occasional undergrowth; next a few small hills, then a brushy plane, followed again and again with the forrests of palm."
  },
  {
    "index_by_10": 25,
    "sentiment": "anger",
    "n": 5,
    "line_number": 249,
    "emotion_word_count": 2,
    "full_text": "This tree returns from its from its branches direct  in a perpendicular line very frequently to the ground  in long cords like ropes, which take root and spring up again, in many shapes and sizes, and in many  cases more than a hundred times from one large tree."
  },
  {
    "index_by_10": 26,
    "sentiment": "anticipation",
    "n": 6,
    "line_number": 257,
    "emotion_word_count": 3,
    "full_text": "At sunrise we arrived at the first- Mountain on our way called the \"Siera Madre\" or Mother Mountain."
  },
  {
    "index_by_10": 27,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 263,
    "emotion_word_count": 2,
    "full_text": "We passed over one high and exceedingly dangerous precipice,  and other unpleasant places, and finally passed through a very narry and precipitous valley that meandered like the bed of a little river diagonally across the mountain, with almost the slightgrade of a rail road, and generally not much over 300 feet in width, but steep and of great height with timber on each side edging up the mountains, the meanderings of this cavern-valley  with its hight cliffs, and little coves and passes, gave to the whole scene a peculiar wildness and Sublimity."
  },
  {
    "index_by_10": 28,
    "sentiment": "anticipation",
    "n": 3,
    "line_number": 270,
    "emotion_word_count": 1,
    "full_text": "Mr Woods prepared himself also by exarming his gun &c."
  },
  {
    "index_by_10": 29,
    "sentiment": "joy",
    "n": 3,
    "line_number": 283,
    "emotion_word_count": 1,
    "full_text": "From appearances within we judge this chappel to contain more real wealth than many of those magnificent edifices of the States."
  },
  {
    "index_by_10": 30,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 297,
    "emotion_word_count": 2,
    "full_text": "In leaving and crossing the river by the ford, it was very gratifying to see about 90 or 100 Mexicans upon the high bluffs and along the road to see us out and bid us a friendly adieu, and Adios, adios, adios, was echoed here, there and yonder, which signifies - \"to God\"- we commend you."
  },
  {
    "index_by_10": 31,
    "sentiment": "anticipation",
    "n": 5,
    "line_number": 309,
    "emotion_word_count": 2,
    "full_text": "Having surmounted the first Series, we descended upon  similar sharp and pointed edges into a wild and  romantic cove, leading off over and around other more  passable hills, in full view of numerous mountains ranging at random in every direction, until we reached the Ranch la Pier, by a small lakeupon a beautiful plane, and here we encamped for the night, having arrived early in the afternoon."
  },
  {
    "index_by_10": 32,
    "sentiment": "anticipation",
    "n": 5,
    "line_number": 319,
    "emotion_word_count": 2,
    "full_text": "On this route I had the pleasure of discovering a  magnificent cavernous Amphitheatre of several thousand feet in diameter, and about 300 feet in perpendicular  debth, covered below with dense timber, and overhung with high arching cliffs of great magnificence."
  },
  {
    "index_by_10": 33,
    "sentiment": "anticipation",
    "n": 14,
    "line_number": 324,
    "emotion_word_count": 3,
    "full_text": "At sunset we descended into a romantic valley and wound around several Sugarloaf hills, by dark into the beautiful village of San Nicholas, where we encamped upon a pleasant plaza of grass in the midst of the village and at the foot of a large and imposing mountain.but suffice it to be said that this days march was the most wild rugged and exhausting of any to San Louis Potosi."
  },
  {
    "index_by_10": 34,
    "sentiment": "anticipation",
    "n": 6,
    "line_number": 333,
    "emotion_word_count": 2,
    "full_text": "We were all in anticipation of a fight, when we saw a small fire upon the summit of a neighboring mountain, supposed to be a signal light."
  },
  {
    "index_by_10": 35,
    "sentiment": "anticipation",
    "n": 12,
    "line_number": 347,
    "emotion_word_count": 4,
    "full_text": "Sund 18th   Day clear and warm. Proceeded on our journey at 6.A.M. very  anxious to get out of this barren and sandy wilderness. and travelled nearly all day over diversified planes of  limestone, palms, maguays, casters, some timber, and for a  mile or two, for the first time a woodland of beautiful cedars.put in the best order, our camp fire put out, and two guards put on duty."
  },
  {
    "index_by_10": 36,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 352,
    "emotion_word_count": 3,
    "full_text": "Soon after leaving this pleasant village, we ascended several large and barren hills, and in a few hours descended a very romantic pass down upon prarie plains and cultivated fields. our views on this days journey were extensive new diversified and interesting."
  },
  {
    "index_by_10": 37,
    "sentiment": "anticipation",
    "n": 12,
    "line_number": 364,
    "emotion_word_count": 4,
    "full_text": "I remained some time behind the company in waiting for  Sherman, as long as I felt it safe from missing the way  myself, expecting him to come up upon this path, [during that time I sketched scene No 14. a high] on our right there was a high mountain [to] [the North] bearing the marks of a large volcano."
  },
  {
    "index_by_10": 38,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 374,
    "emotion_word_count": 2,
    "full_text": "On the way before entering this pass,  and at the commencement of a fine broad road, we  halted for a short time at a large Hacienda, called San  E Pedro No 17. having westward a beautiful mountain view, south the cultivated fields and distant hills, and around the dwelling several beautiful groves, over the principal door was painted in large letters, \"Casa Particular\"."
  },
  {
    "index_by_10": 39,
    "sentiment": "anticipation",
    "n": 4,
    "line_number": 387,
    "emotion_word_count": 2,
    "full_text": "At sun set we arrived at the \"Meson De Fern\" a public house called Pestelius located in a desert of sand, a few miles from a village to the north west and off from the road."
  },
  {
    "index_by_10": 40,
    "sentiment": "anger",
    "n": 5,
    "line_number": 390,
    "emotion_word_count": 2,
    "full_text": "At night, a high wind arose and gave us a complete storm of dust, exceeding anything of the kind that I have ever before witnessed in any country, reminding one of the desert of Arabia.Wednd 21st Day warm and clear."
  },
  {
    "index_by_10": 41,
    "sentiment": "anger",
    "n": 5,
    "line_number": 405,
    "emotion_word_count": 3,
    "full_text": "And are decidedly against the Americans in the popular feeling, and have occasionally expressed those feelings with insults, and a few words of contempt, which some of them have learned from the American deserters, in the English language."
  },
  {
    "index_by_10": 42,
    "sentiment": "joy",
    "n": 8,
    "line_number": 412,
    "emotion_word_count": 2,
    "full_text": "Having travelled 15 miles by 1/2 past 8.O. clock A.M. we entered the Splendid and singular city of San Louis Potosi, having passed through a beautiful little village before entering Potosi."
  },
  {
    "index_by_10": 43,
    "sentiment": "joy",
    "n": 8,
    "line_number": 421,
    "emotion_word_count": 3,
    "full_text": "I also for the first time saw two peach trees in full blossom in a beautiful garden at the suburbs of the city."
  },
  {
    "index_by_10": 44,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 432,
    "emotion_word_count": 2,
    "full_text": "An unfriendly feeling towards the Americans was soon evident from their language  as it was a day of religious ceremonies, and rest from labor, the church and plaza was thronged, by Mexicans dressed in their holliday best."
  },
  {
    "index_by_10": 45,
    "sentiment": "anticipation",
    "n": 11,
    "line_number": 440,
    "emotion_word_count": 2,
    "full_text": "At this place we stopped in a comfortable mason overnight, halting about 4 P.M. An opportunity offering I went and upon the margin of the lake and sketched view No 61 looking west among the mountains over which the sun was setting."
  },
  {
    "index_by_10": 46,
    "sentiment": "anticipation",
    "n": 13,
    "line_number": 450,
    "emotion_word_count": 4,
    "full_text": "To the right of this open plane, there are four parallel rows of the beautiful Alamo trees forming a shady and a very pleasant walk of about one mile from the city proper southward to the front  of the magnificent sanctuary (Santoario) as in fig 25."
  },
  {
    "index_by_10": 47,
    "sentiment": "anticipation",
    "n": 10,
    "line_number": 460,
    "emotion_word_count": 3,
    "full_text": "None but the Catholic religion is tolerated here as in other parts of the Republic, and in passing each Sanctuary, even upon the opposite side of the street, the person is required to takeoff his hat, and retain it in his hand, until he has passed the door of the Sanctuary, otherwise he is liable to be stoned at the shortest notice; if nothing worse may happen him."
  },
  {
    "index_by_10": 48,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 470,
    "emotion_word_count": 2,
    "full_text": "My visits also extended to the magnificent  Sanctuary of St. Domingo, the front of which wasGuarded by a large mounted Cannon, and in a house, beside it several hundred soldiers."
  },
  {
    "index_by_10": 49,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 480,
    "emotion_word_count": 3,
    "full_text": "In chocolate, however, the Mexicans excel, and sometimes in coffee, and especially in light sweet cakes."
  },
  {
    "index_by_10": 50,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 492,
    "emotion_word_count": 3,
    "full_text": "This plaza is almost always densely crowded by  all grades and classes of people, who stare as much as Americans, as though they were Bedouin Arabs; No 31. is a red sand stone fountain, which I sketched in the Southern port of the city at the head of the Allamo                                           walk before described.It is much of the time crowded by visitors for water, No 32. is the chief market plaza; upon this plaza are numerous Doric pillars, well finished from red sand rock, it is intended in time to place a roof upon them so as to shelter the market to be held therein."
  },
  {
    "index_by_10": 51,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 503,
    "emotion_word_count": 2,
    "full_text": "Our Company remained 3 days in San Louis in order to purchase some fresh Animals, shoe others, and prepare for our further progress to Mazatlan."
  },
  {
    "index_by_10": 52,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 510,
    "emotion_word_count": 2,
    "full_text": "Just before sunset we arrived at the Hacienda of Tepetate, the proprietor being hostile to the Americans, would not permit us to occupy the Mason, so that we were compelled to camp out not withstanding the night proved to be very cold; we raised our camp fires, and soon prepared excellent though plain suppers, which took their usual round in messes."
  },
  {
    "index_by_10": 53,
    "sentiment": "anger",
    "n": 7,
    "line_number": 524,
    "emotion_word_count": 2,
    "full_text": "About eleven at night when darkness reigned in blackness, a noise like stampeeding or stealing  our horses and mules took place. 7 or 8 of our party immediately proceeded to search for the intruders with loaded arms, but found none there except our mule drivers; An hour after some alarm was created by hearing about 40, reports similar to the firing of guns in quick succession over in the next valley; we were however ready for any guerrillas or other intruders, but they did not trouble us further, as we fired salutes a number of times which echoed along the valley like sober precautions. [*Tuesday 27th*] Day clear and warm."
  },
  {
    "index_by_10": 54,
    "sentiment": "anticipation",
    "n": 11,
    "line_number": 539,
    "emotion_word_count": 4,
    "full_text": "Our road was broad, well setled, and abounded with shade, water, and pretty scenery, whilst we were most of the time in full view of the two opposite mountain ranges of barrenness on each side of this pleasant valley of groves and gardens."
  },
  {
    "index_by_10": 55,
    "sentiment": "anticipation",
    "n": 10,
    "line_number": 549,
    "emotion_word_count": 4,
    "full_text": "On the North  side of this plaza there stands one among the most  noble and massive Sanctuaries of Mexico, and usually  ranked among her chief churches, which I  endeavored to sketch as in No. 39. it is build of a hard  light red sand stone approaching a cream color; I did  not obtain its dimensions, but it is certainly larger than  any church which I have ever seen in the States, and  in workmanship equal to the finest church of New York.It rises in Lagos like an immense collosal pile, a great monument of perseverance and skill,."
  },
  {
    "index_by_10": 56,
    "sentiment": "anticipation",
    "n": 6,
    "line_number": 551,
    "emotion_word_count": 2,
    "full_text": "The interior is still more splendid than its exterior, gorgeous displays of wealth, immense gothic works in gold and  silver leaf, are suspended from the far off ceiling, an organ, richly decorated is supported by a beautiful and curiously formed gallery, Pilasters of great height trimmed with silver leaf, rise between and separate very large and brilliant paintings."
  },
  {
    "index_by_10": 57,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 563,
    "emotion_word_count": 3,
    "full_text": "The scenery of this deep and narrow valley, with its meandering  water course, and the distant mountains, was peculiarly  barren and wild; but the town had pleasant orange groves, gardens, &c, with shady walks and fountains here and there and a very handsome plaza, upon which  was the largest and finest Sanctuary we had yet seen even surpassing in magnitude the one last seen,  this was indeed a stupendeous pile of human art and perseverance; a sign informed us that its age exceeded 100, years, and it was yet in an excellent state of preservation."
  },
  {
    "index_by_10": 58,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 570,
    "emotion_word_count": 2,
    "full_text": "As our party left early next morning no time of course was available for further sketches.[*Fridy. 30th*] Day clear and warm, Commenced our march at half past six O.clock, crossing a large and costly stone bridge, the handsomest and largest I had yet seen in Mexico; it was handsome and built entirely of a light hard free stone; toll was paid in crossing it. a paved road wound around and up the hill in a serpentine form until it reached the summet, from which there was a splendid view of the town, river, churches, groves, &c; we passed from this pleasant view into another very steep, deep, and narrow valley; from which we arose again to follow a rolling barren country of prarie hills, covered here and there with fragments of loose broken rocks, and much broken chalcedony."
  },
  {
    "index_by_10": 59,
    "sentiment": "anger",
    "n": 3,
    "line_number": 586,
    "emotion_word_count": 3,
    "full_text": "Most of  our company visited him, and by much taking with  the Alcalde had him taken from a miserable cell  of crowded polution, and placed in better quarters,  we could not get him released, and had to leave him  at the mercy of his enraged enemies, and the Alcalde  believing him to be innocent of that charge, although  he frankly acknowledged having stolen 60 dollars  in Mexico, whilst in distress."
  },
  {
    "index_by_10": 60,
    "sentiment": "anticipation",
    "n": 4,
    "line_number": 593,
    "emotion_word_count": 2,
    "full_text": "If he escapes, it will be by some miracle unknown to wiley Frenchmen, and stupid Mexicans."
  },
  {
    "index_by_10": 61,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 603,
    "emotion_word_count": 2,
    "full_text": "Among the rest of the pleasant things to be observed here, was a cool and refreshing mountain spring of considerable size rushing rapidly in various branches down the quick descents of several of its streets."
  },
  {
    "index_by_10": 62,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 617,
    "emotion_word_count": 2,
    "full_text": "Before arriving at Gaudalaxhara, at 4 miles distant, we  passed through a small town of a very pleasant appearance  in which there was the remains of a once superb sanctuary."
  },
  {
    "index_by_10": 63,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 622,
    "emotion_word_count": 2,
    "full_text": "Having arrived in one of the handsomest and greatest cities of all Mexico, I hastened to avail myself of every opportunity to explore and discover its fine arts &c."
  },
  {
    "index_by_10": 64,
    "sentiment": "joy",
    "n": 4,
    "line_number": 631,
    "emotion_word_count": 1,
    "full_text": "A part of the valley about it is under very good cultivation and presents an extensive and civilized appearance."
  },
  {
    "index_by_10": 65,
    "sentiment": "joy",
    "n": 9,
    "line_number": 649,
    "emotion_word_count": 4,
    "full_text": "No such scenes of granduer can yet be found in the States, and I have been repeatedly surprised at the enormous wealth, which must have been lavished upon these religious pallaces in Mexico. judging from the time, and immense labor required in their completion; and in their superior pieces of Sculpture, Architecture, and paintings, with their mammoth bells, and [*53*]fine toned Organs, superior castings, elegant designs, drapery, massive granduer, orders of Architecture, and fine materials, which at this day, far exceeds the small and half civilized capacities of the original Mexican inhabitants."
  },
  {
    "index_by_10": 66,
    "sentiment": "joy",
    "n": 8,
    "line_number": 656,
    "emotion_word_count": 2,
    "full_text": "Shade trees  of great magnitude covered the square, whilst the beds were full of beautiful shrubs in full  bloom, which on entering presented to us the appearance of a beautiful shady grove richly and  closely carpeted with many species of flowers  so ingeniously interwoven as to show the  figgure of one large flower by the shades of  those planted together."
  },
  {
    "index_by_10": 67,
    "sentiment": "anticipation",
    "n": 4,
    "line_number": 669,
    "emotion_word_count": 2,
    "full_text": "Though vehicles of any kind were seldom seen through  the country, yet heavy carriages of a clumsey - [*55*]   appearance for the aristocracy and the Priests were quite plentifull in townThe americans still continue to arrive in this city, 40 more during this day from Mexico."
  },
  {
    "index_by_10": 68,
    "sentiment": "anger",
    "n": 8,
    "line_number": 670,
    "emotion_word_count": 2,
    "full_text": "Wed 4th. Day clear and warm. Commenced our march at 6.O. clock. On leaving the city, we passed the walls of an extensive prison, which was being erected of stone, at the North Western suburbs."
  },
  {
    "index_by_10": 69,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 684,
    "emotion_word_count": 3,
    "full_text": "Upon the right and upon the left were seen towering mountains, with immense barren cliffs above cliffs, and their numerous rugged woodless spears rising high in the air like collosal ruins of pyramids of yet untold of magnitude."
  },
  {
    "index_by_10": 70,
    "sentiment": "anticipation",
    "n": 10,
    "line_number": 691,
    "emotion_word_count": 2,
    "full_text": "O. clock singing in concert, the national songs of America, some 60 or 70 Mexicans, crowded around them seemingly much delighted."
  },
  {
    "index_by_10": 71,
    "sentiment": "anticipation",
    "n": 6,
    "line_number": 707,
    "emotion_word_count": 2,
    "full_text": "Our landlord stepping forward told them that they must wait a short time until he could see further about his accomodations."
  },
  {
    "index_by_10": 72,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 715,
    "emotion_word_count": 4,
    "full_text": "Its a matter of course all our men were prompt in self defence, and with our guns, pistols, and knives, in hand and about us, we drew up in order, compactly before the door, facing the Robbers, who stood quietly facing and viewing us as mute as a posse of terrified owls; the Alcalde and our landlord refused them admittance into our Mason, but they would have entered by force had not our company presented a bolder front, headed by Capt Grant, of Philadelphia; who told them that they should not enter, except at the peril of their lives, at the same time every trigger was ready to tell."
  },
  {
    "index_by_10": 73,
    "sentiment": "anticipation",
    "n": 13,
    "line_number": 720,
    "emotion_word_count": 4,
    "full_text": "It was a most beautiful moonlight night, and now and then a gentle breeze played fitfully from the beautiful lake of Madalena; My turn among the sentinels came from 12 to 2 O clock in the morning; and my positions around the high walls, and the expansive enclosed yards, was pleasant and romantic during so pleasant a night as this; seeming at times like a dream, that I were facing therounds of some ancient castle and looking down among the  dark shades of the groves around slumbering in silence beneath the full and magic moon."
  },
  {
    "index_by_10": 74,
    "sentiment": "anticipation",
    "n": 15,
    "line_number": 738,
    "emotion_word_count": 6,
    "full_text": "I was afterwards told for the purpose of washing out the silver ore beneath the road, seen on the mountainside, there is a small and pleasant village, in which there is an abundance of fine fruits and surrounded by extensive green fields, meadows, groves, and fine timbers along the stream that meanders through its valley, that spreads  out to a ---triangular cove, dotted with several pleasant Rancho's, No 70. is a sketch taken on entering this pleasant cove where the village was located."
  },
  {
    "index_by_10": 75,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 740,
    "emotion_word_count": 2,
    "full_text": "Time would not permit me to sketch as much as I desired, No 71. shows the workmanship on our fine road over, one of the most formidable mountains in Mexico, it is cut out of the rocks, and walled paved and graded thus all the way up this mountain for a distance of six miles. and as great a piece of work of its kind, as any that I know of in the U States of America."
  },
  {
    "index_by_10": 76,
    "sentiment": "anticipation",
    "n": 10,
    "line_number": 751,
    "emotion_word_count": 2,
    "full_text": "A pleasant stream of water meandered along this  valley, the margin of which was thickly interwoven with brushwood, wildflowers, and followed by pleasant green meadows, which contrasted in a striking manner with the shadeless, and wild barren mountains; that were broken and rudely tossed into the high air as the fierce storms would toss the waters of the mighty ocean; and as rudely wild, and void of vegetation or timber in many places."
  },
  {
    "index_by_10": 77,
    "sentiment": "anticipation",
    "n": 5,
    "line_number": 766,
    "emotion_word_count": 2,
    "full_text": "Proceeding down this pleasant valley and winding around various spurs of the wild mountains, that  rear'd their rugged heads upon either side of us, we at 15 miles from Eastlan opened upon a view as in No. 75, with the appearance of a volcano to the right hand."
  },
  {
    "index_by_10": 78,
    "sentiment": "fear",
    "n": 6,
    "line_number": 779,
    "emotion_word_count": 4,
    "full_text": "The mountains around were exceedingly wild, and only a few of them even sparsely timbered by a dwarfish growth, of scrubb oaks, pines, and wild cactus. This broad triangular cove or great valley, was traversed  in every direction by hills, between which were small and  fertile coves, passes, and ravines, along which only the villages  and Ranchos were located."
  },
  {
    "index_by_10": 79,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 783,
    "emotion_word_count": 2,
    "full_text": "During this afternoon Mr Slaight and Mr Jones two of our company were misled upon the wrong track, which caused some fears as to their safety, but both came into camp just  before dark.It is highly important that companies should keep compact whilst crossing the Mountains of Mexico, as those who stray off, are liable to be cut off by those who constantly watch such opportunities in the  trail of the large parties who may cross their country  April 8th  Day warm and clear."
  },
  {
    "index_by_10": 80,
    "sentiment": "anticipation",
    "n": 16,
    "line_number": 790,
    "emotion_word_count": 3,
    "full_text": "About an hour after sketching the former, we commenced descending a graded road down the mountain,  a part of which I sketched as in No 80. after which we  crossed a fine creek, then passed over and around a number of wild hills with but few scattering habitations, and those of the poorest kind until we came out upon the open woodless hills, that were beautifully rounded and moulded as by art, and only covered by parched prairie grass, and  ranging thus at random around the base of the great Novelio Mountain, whilst sloping off gently in an extensive valley, which was walled in on the North, East, and South by formidable mountains.Again, we ascended a small ridge, which soon gave us a fine view of the great valley of Tepec."
  },
  {
    "index_by_10": 81,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 800,
    "emotion_word_count": 3,
    "full_text": "Far beyond which formidable mountains reared their misty shadows in dim outline high upon the horizon, upon which the morning's sun had already arissen in his glory amid flitting clouds."
  },
  {
    "index_by_10": 82,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 815,
    "emotion_word_count": 2,
    "full_text": "The whole scenery about this factory is  pretty, tasty and romantic."
  },
  {
    "index_by_10": 83,
    "sentiment": "anticipation",
    "n": 5,
    "line_number": 824,
    "emotion_word_count": 2,
    "full_text": "Many farms here appeared like little paradis's for shade romance, and the comforts of life; and many were the  varied scenes of this [day] morning that were really captivating. [except] But in the after part of the day upon the planes, having descended upon a warmer country, we were  open more to the sun, and much annoyed by dust."
  },
  {
    "index_by_10": 84,
    "sentiment": "joy",
    "n": 6,
    "line_number": 831,
    "emotion_word_count": 2,
    "full_text": "These five large shade trees, are however not too abundant, and by seeing them in the distance I frequently judged our distance from a Rancho; as they are favorite trees on these planes."
  },
  {
    "index_by_10": 85,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 848,
    "emotion_word_count": 3,
    "full_text": "Much of this days travels, all things considered is not by any means inviting to travellers; being dusty in places open to the hot sun, and much of the time rather uncivilized in appearance, which however is no criterion to judge western Mexico by."
  },
  {
    "index_by_10": 86,
    "sentiment": "anticipation",
    "n": 3,
    "line_number": 851,
    "emotion_word_count": 1,
    "full_text": "A friend Mr Custer, and I went out afar the creak near by for game, and we returned in about 15 minutes with 3 large Pheasants upon which we made a fine supper, and obtained plenty more for our breakfast, and to carry with us for our dinner, our company numbering at this time between 25 and 30."
  },
  {
    "index_by_10": 87,
    "sentiment": "anticipation",
    "n": 9,
    "line_number": 868,
    "emotion_word_count": 3,
    "full_text": "A range of mountains seem'd now to range off west to the Pacific Ocean, over which it appeared that we must pass, on the morrow; approaching within a few miles of their wild and rugged base, we encamped at a Rancho called Cerauso, as in Sketch No 95. here things appeared more genteel than on the previous night and we were enabled to purchase a scanty allowance of provisions, which were in demand and highly acceptable."
  },
  {
    "index_by_10": 88,
    "sentiment": "anticipation",
    "n": 8,
    "line_number": 872,
    "emotion_word_count": 2,
    "full_text": "The location of this town with its mountain scenery was very pretty and interesting."
  },
  {
    "index_by_10": 89,
    "sentiment": "anticipation",
    "n": 12,
    "line_number": 885,
    "emotion_word_count": 4,
    "full_text": "For some time I supposed that we were coming to the margin of a lake whose waters were troubled into waves by wind, but on approaching the same, I discovered the mistake; by discovering that the heat of the Sun caused a mist to arise from the sand, which by its position and  reflection to the eye caused the deception called mirage. about noon we arrived in the old village of Mazatlan distant from the present Sea port of Mazatlan, about 24  miles."
  },
  {
    "index_by_10": 90,
    "sentiment": "anticipation",
    "n": 7,
    "line_number": 892,
    "emotion_word_count": 4,
    "full_text": "The fresh breeze was fanning us from the pacific; the declining Sun was shedding his gentler evening rays upon us from over the hills of the Port of Mazatlan, as we wound our way around that pretty lake before named, and crossing the flats, we arising suddenly upon a high ground came at once in full view of the long sought for port of Mazatlan, and for the first time a broad and beautiful view of the Pacific Ocean, its islands, shipping, and its foaming  surfs that chased each other rapidly upon the pretty beach before us."
  }
]
